In [8]:
import pandas as pd

## Load

In [9]:
profile = pd.read_json('../data/raw/profile.json', orient='records', lines=True)
profile.head()

  gender  age                                id  became_member_on    income
0   None  118  68be06ca386d4c31939f3a4f0e3dd783          20170212       NaN
1      F   55  0610b486422d4921ae7d2bf64640c50b          20170715  112000.0
2   None  118  38fe809add3b4fcf9315a9694bb96ff5          20180712       NaN
3      F   75  78afa995795e4d85b5d9ceeca43f5fef          20170509  100000.0
4   None  118  a03223e636434f42ac4c3df47e8bac43          20170804       NaN

## Rename

In [10]:
profile = profile.rename(columns={'id': 'profile_id'})
profile.head()

  gender  age                        profile_id  became_member_on    income
0   None  118  68be06ca386d4c31939f3a4f0e3dd783          20170212       NaN
1      F   55  0610b486422d4921ae7d2bf64640c50b          20170715  112000.0
2   None  118  38fe809add3b4fcf9315a9694bb96ff5          20180712       NaN
3      F   75  78afa995795e4d85b5d9ceeca43f5fef          20170509  100000.0
4   None  118  a03223e636434f42ac4c3df47e8bac43          20170804       NaN

## Clean

In [11]:
# Convert became_member_on to datetime and create new column
profile['become_member_on_date'] = pd.to_datetime(profile['became_member_on'], format='%Y%m%d')
profile.drop("became_member_on", axis=1, inplace=True)
profile.head()

,gender,age,profile_id,income,become_member_on_date
0,None,118,68be06ca386d4c31939f3a4f0e3dd783,NaN,2017-02-12
1,F,55,0610b486422d4921ae7d2bf64640c50b,112000.0,2017-07-15
2,None,118,38fe809add3b4fcf9315a9694bb96ff5,NaN,2018-07-12
3,F,75,78afa995795e4d85b5d9ceeca43f5fef,100000.0,2017-05-09
4,None,118,a03223e636434f42ac4c3df47e8bac43,NaN,2017-08-04

## Save

In [12]:
profile.to_csv('../data/processed/profile.csv', index=False)